MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
/* Biquad filter state for loudness (stereo - L and R channels) */
/* Low-shelf filter: boost bass frequencies (+6dB @ 100Hz) */
typedef struct {
    float x1, x2;  /* Input history */
    float y1, y2;  /* Output history */
} BiquadState;

static BiquadState loudness_state_L = {0};
static BiquadState loudness_state_R = {0};

/* Biquad coefficients for low-shelf filter
 * Calculated for: Fs=44100Hz, Fc=150Hz, Gain=+6dB, Q=0.707
 * Using Audio EQ Cookbook formula (Robert Bristow-Johnson) */
static const float loudness_b0 = 1.005260f;
static const float loudness_b1 = -1.974408f;
static const float loudness_b2 = 0.969786f;
static const float loudness_a1 = -1.974567f;
static const float loudness_a2 = 0.974887f;

/* ==========================================================================
 * Bass Boost Filter (+8dB @ 100Hz)
 * ========================================================================== */
static BiquadState bass_state_L = {0};
static BiquadState bass_state_R = {0};

/* Bass Boost: Low-shelf +8dB @ 100Hz, S=0.7 */
static const float bass_b0 = 1.005677f;
static const float bass_b1 = -1.980528f;
static const float bass_b2 = 0.975169f;
static const float bass_a1 = -1.980624f;
static const float bass_a2 = 0.980750f;

/* ==========================================================================
 * Duck Mode (-12dB gain reduction)
 * ========================================================================== */
#define DUCK_GAIN_LIN       0.251189f  /* 10^(-12/20) = ~25% volume */
static float duck_current_gain = 1.0f;
static float duck_target_gain = 1.0f;

/* ==========================================================================
 * Normalizer / DRC (Dynamic Range Compression)
 * Tuned for transparent leveling without "pumping"
 * Threshold: -12dB (only compress loud parts)
 * Ratio: 2:1 (gentle compression)
 * Attack: 10ms, Release: 80ms (faster recovery)
 * Makeup: +3dB (subtle boost)
 * ========================================================================== */
#define DRC_THRESHOLD_LIN   0.251189f  /* 10^(-12/20) = -12dB */
#define DRC_RATIO           2.0f       /* Gentle 2:1 ratio */
#define DRC_ATTACK_COEF     0.002268f  /* ~10ms attack */
#define DRC_RELEASE_COEF    0.000284f  /* ~80ms release */
#define DRC_MAKEUP_LIN      1.412538f  /* +3dB makeup gain */

static float drc_envelope = 0.0f;      /* Current envelope level */
static float drc_gain_smooth = 1.0f;   /* Smoothed gain reduction */

/* Apply biquad filter to a single sample (generic version) */
static inline float biquad_process_coef(BiquadState *state, float input,
                                        float b0, float b1, float b2,
                                        float a1, float a2)
{
    float output = b0 * input
                 + b1 * state->x1
                 + b2 * state->x2
                 - a1 * state->y1
                 - a2 * state->y2;

    /* Shift history */
    state->x2 = state->x1;
    state->x1 = input;
    state->y2 = state->y1;
    state->y1 = output;

    return output;
}

/* Loudness filter wrapper */
static inline float loudness_process(BiquadState *state, float input)
{
    return biquad_process_coef(state, input,
                               loudness_b0, loudness_b1, loudness_b2,
                               loudness_a1, loudness_a2);
}

/* Bass Boost filter wrapper */
static inline float bass_process(BiquadState *state, float input)
{
    return biquad_process_coef(state, input,
                               bass_b0, bass_b1, bass_b2,
                               bass_a1, bass_a2);
}

/* DRC/Compressor process - returns smoothed gain factor */
static inline float drc_process(float input_level)
{
    /* Peak detection with attack/release envelope */
    float abs_level = (input_level < 0) ? -input_level : input_level;

    if (abs_level > drc_envelope) {
        /* Attack: fast rise */
        drc_envelope += DRC_ATTACK_COEF * (abs_level - drc_envelope);
    } else {
        /* Release: slow fall */
        drc_envelope += DRC_RELEASE_COEF * (abs_level - drc_envelope);
    }

    /* Calculate target gain */
    float target_drc_gain;
    if (drc_envelope > DRC_THRESHOLD_LIN) {
        /* Above threshold: apply compression */
        float excess_ratio = drc_envelope / DRC_THRESHOLD_LIN;
        float compressed = DRC_THRESHOLD_LIN * powf(excess_ratio, 1.0f / DRC_RATIO);
        target_drc_gain = (compressed / drc_envelope) * DRC_MAKEUP_LIN;
    } else {
        /* Below threshold: just apply makeup gain */
        target_drc_gain = DRC_MAKEUP_LIN;
    }

    /* Smooth the gain changes to avoid artifacts */
    drc_gain_smooth += 0.01f * (target_drc_gain - drc_gain_smooth);

    return drc_gain_smooth;
}

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_SAI2_Init(void);
void Error_Handler(void);

/* Audio processing */
static void Audio_Process(int16_t *rx_buf, int16_t *tx_buf, uint16_t samples);

/* Debug printf redirection to USART3 */
int _write(int file, char *ptr, int len)
{
    HAL_UART_Transmit(&huart3, (uint8_t *)ptr, len, HAL_MAX_DELAY);
    return len;
}

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{
    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();          // DMA must be initialized before peripherals that use it
    MX_USART3_UART_Init();  // Debug console first

    /* Boot message with build number */
    printf("\r\n\r\n*** 42dB DSP Engine (Build #%d) ***\r\n", BUILD_NUMBER);

    printf("[OK] HAL initialized\r\n");
    printf("[OK] Clock configured\r\n");
    printf("[OK] GPIO initialized\r\n");
    printf("[OK] DMA initialized\r\n");
    printf("[OK] USART3 (debug console) initialized\r\n");

